# SetPadAttrs

## Description
Applies pad attributes to input handle.

```pascal
PROCEDURE SetPadAttrs(hPadHandle : HANDLE);
```

```python

def vs.SetPadAttrs(hPadHandle):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hPadHandle|HANDLE||

## Version
Availability: from Vectorworks 2015
## Category
* SiteModel Interface Library